Revit 2027 API
BuiltInFailures.DimensionFailures.WrongConstraintInGridChainSketch Property
 Curve in a GridChain sketch cannot be constrained to a sub-grid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WrongConstraintInGridChainSketch { get; }
Public Shared ReadOnly Property WrongConstraintInGridChainSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WrongConstraintInGridChainSketch {
	FailureDefinitionId^ get ();
}
static member WrongConstraintInGridChainSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace